app/controllers/api/v1/agents_controller.rb

SELECT "agents".* FROM "agents" WHERE "agents"."user_id" = $1 AND "agents"."id" = $2 LIMIT $3  [["user_id", 28], ["id", 22], ["LIMIT", 1]]
---
      def show
        agent = current_user.agents.find_by(id: params[:id])

INSERT INTO "agents" ("user_id", "created_at", "updated_at", "name", "llm_model", "model_config", "parent_id", "origin", "metadata", "client") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
      def create
        agent = current_user.agents.build(agent_params)
        if agent.save

SELECT "agents".* FROM "agents" WHERE "agents"."user_id" = $1 AND "agents"."id" = $2 LIMIT $3  [["user_id", 31], ["id", 24], ["LIMIT", 1]]
SELECT "memory_chunks"."id", "memory_chunks"."topic", "memory_chunks"."summary", "memory_chunks"."skills_demonstrated", "memory_chunks"."transcript_id", "memory_chunks"."message_range_start", "memory_chunks"."message_range_end", "memory_chunks"."created_at" FROM "memory_chunks" WHERE "memory_chunks"."agent_id" = $1  [["agent_id", 24]]
---
      def memories
        agent = current_user.agents.find_by(id: params[:id])
        return render json: {error: "Not found"}, status: :not_found unless agent

        chunks = agent.memory_chunks.select(:id, :topic, :summary, :skills_demonstrated,
          :transcript_id, :message_range_start, :message_range_end, :created_at)

SELECT "agents".* FROM "agents" WHERE "agents"."user_id" = $1 AND "agents"."id" = $2 LIMIT $3  [["user_id", 32], ["id", 25], ["LIMIT", 1]]
---
      def transcripts
        agent = current_user.agents.find_by(id: params[:id])