app/controllers/api/v1/messages_controller.rb

INSERT INTO "messages" ("transcript_id", "agent_id", "role", "content", "thinking", "sequence", "timestamp", "metadata", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
      def create
        transcript = find_transcript
        return render json: {error: "Not found"}, status: :not_found unless transcript

        unless transcript.active?
          return render json: {errors: ["Cannot add messages to a completed transcript"]},
            status: :unprocessable_content
        end

        message = transcript.messages.build(message_params.merge(agent_id: transcript.agent_id))
        if message.save

SELECT "transcripts".* FROM "transcripts" INNER JOIN "agents" ON "agents"."id" = "transcripts"."agent_id" WHERE "agents"."user_id" = $1 AND "transcripts"."id" = $2 LIMIT $3  [["user_id", 86], ["id", 34], ["LIMIT", 1]]
---
      def find_transcript
        Transcript.joins(:agent).where(agents: {user_id: current_user.id}).find_by(id: params[:transcript_id])