app/controllers/api/v1/transcripts_controller.rb

SELECT "agents".* FROM "agents" WHERE "agents"."user_id" = $1 AND "agents"."id" = $2 LIMIT $3  [["user_id", 53], ["id", 43], ["LIMIT", 1]]
INSERT INTO "transcripts" ("agent_id", "source", "source_session_id", "status", "started_at", "completed_at", "metadata", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
      def create
        agent = current_user.agents.find_by(id: transcript_params[:agent_id])
        unless agent
          return render json: {errors: ["Agent not found or not owned by you"]}, status: :unprocessable_content
        end

        transcript = agent.transcripts.build(transcript_params.merge(started_at: Time.current))
        if transcript.save

UPDATE "transcripts" SET "status" = $1, "completed_at" = $2, "updated_at" = $3 WHERE "transcripts"."id" = $4  [["status", 1], ["completed_at", "2026-03-01 19:25:00.111448"], ["updated_at", "2026-03-01 19:25:00.114239"], ["id", 18]]
---
      def update
        transcript = find_transcript
        return render json: {error: "Not found"}, status: :not_found unless transcript

        attrs = transcript_params
        attrs = attrs.merge(completed_at: Time.current) if attrs[:status] == "completed" && transcript.active?

        if transcript.update(attrs)

SELECT "agents".* FROM "agents" WHERE "agents"."user_id" = $1 AND "agents"."id" = $2 LIMIT $3  [["user_id", 156], ["id", 135], ["LIMIT", 1]]
SELECT COUNT(*) FROM "messages" WHERE "messages"."transcript_id" = $1  [["transcript_id", 76]]
---
      def import
        agent = current_user.agents.find_by(id: params[:agent_id])
        unless agent
          return render json: {errors: ["Agent not found or not owned by you"]}, status: :unprocessable_content
        end

        transcript = TranscriptImporter.new(
          agent: agent,
          jsonl_content: params[:jsonl],
          source: params[:source] || "claude-code",
          source_session_id: params[:source_session_id],
          metadata: params[:metadata]&.permit!.to_h
        ).import

        SummarizeTranscriptJob.perform_later(transcript.id)

        render json: {
          id: transcript.id,
          status: transcript.status,
          message_count: transcript.messages.count,
          agent_id: transcript.agent_id

SELECT "transcripts".* FROM "transcripts" INNER JOIN "agents" ON "agents"."id" = "transcripts"."agent_id" WHERE "agents"."user_id" = $1 AND "transcripts"."id" = $2 LIMIT $3  [["user_id", 57], ["id", 18], ["LIMIT", 1]]
---
      def find_transcript
        Transcript.joins(:agent).where(agents: {user_id: current_user.id}).find_by(id: params[:id])